emacs-bash-completions-is-a-doorway-to-simplicity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc1a3b0e">Introduction</a></li>
<li><a href="#org7f368c5">Hello, bash-completion</a></li>
<li><a href="#org9f1c54f">async-shell-command and friends</a></li>
<li><a href="#org8e5be85">babashka tasks</a></li>
<li><a href="#orgf9e1251">compilation</a></li>
<li><a href="#org049d3fc">it gets even better</a></li>
<li><a href="#orgb3d4bec">more levers</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc1a3b0e" class="outline-2">
<h2 id="orgc1a3b0e">Introduction</h2>
<div class="outline-text-2" id="text-orgc1a3b0e">
<p>
I sometimes get asked
</p>

<blockquote>
<p>
What is the single most important package in your emacs config that
makes you more productive?
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7f368c5" class="outline-2">
<h2 id="org7f368c5">Hello, bash-completion</h2>
</div>

<div id="outline-container-org9f1c54f" class="outline-2">
<h2 id="org9f1c54f">async-shell-command and friends</h2>
</div>


<div id="outline-container-org8e5be85" class="outline-2">
<h2 id="org8e5be85">babashka tasks</h2>
<div class="outline-text-2" id="text-org8e5be85">
<p>
I can write build tasks in my favority language clojure, with the
development ergonomics of a lisp.
</p>
</div>
</div>



<div id="outline-container-orgf9e1251" class="outline-2">
<h2 id="orgf9e1251">compilation</h2>
<div class="outline-text-2" id="text-orgf9e1251">
<p>
Using emacs <code>project.el</code> I get a beautiful flow of invoking bb tasks:
I just need a project with a <code>.git</code> dir.
And I invoke <code>project-compile</code>, type in ~bb
</p>
</div>
</div>


<div id="outline-container-org049d3fc" class="outline-2">
<h2 id="org049d3fc">it gets even better</h2>
<div class="outline-text-2" id="text-org049d3fc">
<p>
With a recent version of emacs
revert-buffer-function
</p>
</div>
</div>



<div id="outline-container-orgb3d4bec" class="outline-2">
<h2 id="orgb3d4bec">more levers</h2>
<div class="outline-text-2" id="text-orgb3d4bec">
<p>
a lever
a doorway
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.4)</p>
</div>
</body>
</html>
